# Specification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..Specification Property
FabricationPart Class See Also
---
The fabrication part specification identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int Specification { get; set; }
```

Visual Basic
---
```text
Public Property Specification As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Specification {
	int get ();
	void set (int value);
}
```

# Remarks
A value of 0 indicates the specification is set to undefined.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: the specification is invalid for the fabrication part. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: the specification is not able to be modified. -or- When setting this property: the fabrication part is connected to more than one item. -or- When setting this property: the specification fails to be set by identifier: specId. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace